st = "АААААбл"                            #   задаем строку
freq = {}                                 #   создаем пустой словарь

for ch in st:                             #   перебираем каждый символ строки; ch текущий символ
    freq[ch] = freq.get(ch, 0) + 1        #   увеличиваем счётчик для символа ch:
                                          #       если его ещё нет в словаре, считаем, что было 0, и прибавляем 1;
                                          #       если есть берём текущее значение и тоже прибавляем 1

print(freq)                               #   выводим словарь в строчку
for key, value in freq.items():           #   перебираем каждый ключ key и значение value в словаре freq
    print(key, value)                     #   выводим пару "key (символ) : value (сколько раз встретился в строке st)"