"""Строки. Начальный курс"""
# Строка - последовательность символов, где индексация начинается с нуля

s = 'Здравствуйте, гости!'


# for i in s :
#     print(i, end =' ')
# print(len(s))
#
# print(s[19])  #  печать индекса s переменная [19] - индекс
# print(__doc__)  #  печать документальной строки


# for i in range(len(s)) :
#     print(i, s[i], end = ' ')
#
# print(s[:12])  #  от нулевого до одиннадцатого индекса т.к 12-тый не включается
# print(s[4:])
# print(s[4::-1_1. Знакомство с Python])
# print(s[::-1_1. Знакомство с Python])
#
#
s1 = 'казак'
# print(s1[:])
# print(s1[::-1_1. Знакомство с Python])

print(s.isalpha())  #    состоит ли строка только из букв
print(s1.isdigit())  #  состоит ли строка только из цифр
print(s1.isalnum())  #  состоит ли строка только из цифр и букв
print(s1.isspace())  #  состоит ли строка из пробелов
print(s.isupper())  #  состоит ли строка из больших букв
print(s1.islower())  #  состоит ли строка из маленьких букв
print(s.startswith('ЗдраВ'))  #  начинается ли строка с подстроки в скобках
print('раВ' in s)  #   входит ли подстрока в переменную
print(s.endswith('!'))  #   заканчивается ли строка воскл знаком
print(s.lower())  #  напечатать все буквы маленькими

s1 = s.lower()

print(s.title())  #  каждое слово строки с большой буквы
print(s.capitalize())  #  первая буква большая, а остальные маленькие
print(s.center(80))  #  напечатать строку по центру 80 символов
print(s.rjust(80))  #  выравнивание по правому краю
print(s.ljust(80))  #  выравнивание по левому краю
print(s.swapcase())  #  перевернуть маленькие и большие буквы
print(s.strip('! З'))  #  удаление знаков по краям если ничего не указано, то удаляются пробелы
print(s.rstrip('!'))  #  удаление справа
print(s.lstrip('!'))  #  удаление слева
print(s.index('т', 7))  #  поиск индекса в диапазоне индексов
print(s.find('т', 7, 11))  # найти символ
print(s.replace('т', 'Т'))  #  поменять символы

# методы можно применять каскадно print(s.replace().replace())

# если изменения строки нужно сохранить результат нужно присвоить другой переменной

ls = s.split()  #  разбиение строки на объекты по пробелам. Изменяет строку на список по разделителю. Разделитель можно выбрать
print(ls)

print(','.join(ls))  #  собирает строковые объекты списка в строку


s11 = 'aaa bbb ccc ddd '
s2 = '111 222 333 444 '

res = ''
# print(res)

for i in range(0, len(s11), 4) :
    res += s11[i:i + 4] + s2[i:i + 4]
print(res)