from turtle import *

colormode(255)  #   разрешаем использовать режим RGB
color((255, 0, 0), (0, 255, 0))  #  определяется цвет пера и заполнения
pensize(3)  #  размер пера (линии)

# begin_fill()

for i in range(3) :  #  3 повторения создания квадрата
    begin_fill()  #  начало заполнения
    for quad in range(4) :  #  цикл создания квадрата
        forward(30)  #  вперед на 30 пикселей
        left(90)  #  поворот налево 90 градусов

    end_fill()  #  конец заполнения (каждый квадрат заполняется сразу после создания)
    penup()  #  перо вверх
    forward(60)  #  вперед на 60 пикселей
    pendown()  #  перо вниз

# end_fill()

mainloop()   #   mainloop() = turtle.done() оставляют окно открытым