import turtle
t = turtle.Turtle()  # создаём черепашку
t.shape('turtle')  #  определяем форму крсора - черепашка
turtle.colormode(255)  # включаем RGB-режим: цвета от 0 до 255
t.speed(2)  #  скорость черепашки

t.penup()  #  поднимается перо что у треугольников небыло обводки
t.fillcolor(0, 200, 0)  #  задается цвет заполнения
t.pencolor(255, 0, 0)  #  задается цвет обводки

# side = 200  #  задается размер стороны треугольника
step = 75  #  задается величина смещения треугольника

t.goto(-100,0)  #  черепашку идет на стартовую позицую что елка была в центре

for side in range(200, 99, -50) :  #  три перемещения черепашки для начала следующего треугольника
    t.begin_fill()
    for _ in range(3) :  #  рисуются три треугольника
         t.fd(side)
         t.lt(120)
    t.end_fill()  # крнец заполнения прямоугольника цветом
    t.lt(90)  #  поворот налево для перехода к началу следующего треугольника
    t.fd(step)  #  перемещение на величину смещения
    t.rt(90)  #  поворот направо в сторону стартовой позиции
    t.fd(step / 3)  #  движение к стартовой позиции чтобы треугольники лежали на одной оси
    # side -= 50  #  изменение размера стороны треугольника

turtle.done()  #  оставить окно открытым