# сумма цифр в числе

# n = int(input('> '))
# nn = n
# sm = 0
# cnt = 0
# while n > 0:
#     remince = n % 10  # получаем последнюю цифру числа
#     sm += remince  # прибавляем полученную цифру в sm
#     cnt += 1  # увеличиваем счетчик на единицу
#     n //= 10  # получаем целую часть числа после отделения последней цифры
# print(f'В числе "{nn}" {cnt} ц. суммой {sm}.')



#  инвертировать число

# n = int(input('> '))  # 123
# res = 0
# while n > 0:
#     remince = n % 10  # 3 -> 2 -> 1
#     res = res * 10 + remince  # 3 -> 30 + 2= 32 -> 320 + 1 = 321
#     n //= 10  # 12 -> 1 -> 0
# print(res)





"""  Наибольший Общий Делитель НОД
36  24 -> 36 - 24 = 12
12  24 -> 24 - 12 = 12
12  12 -> 12 = 12 ->nod
"""




# НОД с импортом математики

# n1 = int(input('> '))
# n2 = int(input('>> '))
# print(f'NOD = {math.gcd(n1, n2)}')
# while n1 != n2:
#     if n1 > n2:
#         n1 -= n2  # n1 = n1 - n2
#     else:
#         n2 -= n1
# print(f'NOD = {n1}')



n = 5
for i in range (2, n) :
    if n % i == 0 :
        break
else :
    print(n)