"""СПИСКИ (list)
тип данных - списки, структура данных - массив."""
import random
from copy import deepcopy   #   два этих импорта избыточны
import copy   #   обычно либо "from copy import deepcopy" либо "import copy"

# print(__doc__)


"""Список - упорядоченный набор объектов"""
"""      0   1   2   3   4   """
nums = [22, 33, 44, 55, 99]
"""     -5  -4  -3  -2  -1   """



# print(nums[-3])           #      вывод из списка nums элемента с индексом -3
# print(nums[2])            #   вывод списка nums элемента с индексом 2
# print(nums[-3:0:-1])      #   вывод среза от индекса -3(нижний) до 0(верхний) движение влево с шагом -1
# print(nums[2:-5:-1])      #   вывод среза от индекса 2(верхний) до индекса -5(нижний) движение с шагом -1
# print(nums[2::-1])        #   вывод среза от индекса 2 до конца включительно с шагом -1 движение влево



# print(nums[2:])              #   вывод элементов с индекса 2 и до конца
# print(nums[::-1])            #   реверсивный вывод информации
# nums = [20, 30, [40, 50]]    #   изменение списка nums
# print(nums)
# print()
# s = nums
# s = nums.copy()
# print(s)
# print()
# s = nums[:]
# print(s)
# print()
# s = deepcopy(nums)           #   копирование со всем содержимым используя deepcopy (from copy import deepcopy)
# s = copy.deepcopy(nums)      #   копирование со всем содержимым используя deepcopy (import copy)
# nums[0] = 200
# nums[-1][0] = 400
# print(nums)
# print(id(nums))
# print(id(s))
# print(s)
# nums[:3] = 10, 20, 30        #   срез (замена элементов списка [200, 30, [400, 50]) от начала до индекса 3 (не включая его)», элементы с индексами 0, 1, 2 \ 200 - 10, 30 - 20, [400, 50] - 30
#


# ls = [10, 'Dasha', 5.45, True, [67,'Andre']]   #   создан список ls
# lst = [['Masha', 18], ['Dasha', 22]]           #   создан список lst
# name = ['Masha', 'Dasha']                      #   создан список name
# age = [18, 22]                                 #   создан список age
# print(name[1], age[1])                         #   вывод элемента с индексом 1 из списка name и элемента с индексом 1 из списка age
# print(name[0], age[0])                         #   вывод элемента с индексом 0 из списка name и элемента с индексом 0 из списка age
# print(nums)                                    #   вывод списка nums



# nums = [55, 33, 44, 99, 77]   #   список nums переопределен, а создан в самом начале
# print(id(nums))               #   вывод id nums
# nums.append(100)              # временная сложность O(1) - константная
# print(nums)                   #
# nums.insert(3, 200)           # временная сложность O(n) - линейная, на индекс 3 вставлен элемент 200, все остальные двигаются влево
# print(nums)
# nums.extend([1, 2])           #   в конец списка nums добавлен элемент [1, 2], являющийся списком
# print(nums)
# nums += [1, 2]                #   в конец списка nums добавлен элемент [1, 2], являющийся списком
# print(nums)
# nums = nums + [1, 2]          #   в конец списка nums добавлен элемент [1, 2], являющийся списком
# print(nums)



# nums.pop()              #   удаляет последний элемент списка временная сложность O(1) - константная
# print(nums)
# n = nums.pop()          #   удаляет последний элемент списка временная сложность O(1) - константная
# print(nums)
# # del n
# nn = nums.pop(2)        #   удаляет элемент с индексом 2 списка временная сложность O(1) - константная
print(nums)

# while 55 in nums:       #   пока элемент 55 есть в списке он удаляется
#     nums.remove(55)
#     print(nums)

# nums.remove(33)         #   удаляет первое вхождение значения 33 из списка nums
# print(nums)
# print(nums.index(55))   #   вывод индекса элемента 55
# print(nums.count(55))   #   вывод количества элементов 55 в списке, в этом случае 1 [22, 33, 44, 55, 99]
# print(sum(nums))        #   вывод суммы элементов списка
# print(max(nums))        #   вывод максимального элемента списка
# print(min(nums))        #   вывод минимального элемента списка
# nums.reverse()          #   реверс списка nums, если сделать print(nums.reverse()), то выведется None
# print(nums)
# nums1 = [1, 84, 3, 45, 34]                             #   создан список nums1
# print("Список: ", nums1)                               #   вывод списка nums1
# nums1.sort()                                           #   сортировка списка nums1
# print("Отсортированный список: ", nums1)               #   сортировка отсортированного списка nums1
# nums1.sort(reverse=True)                               #   сортировка списка по убыванию
# print("Отсортированный по убыванию список: ", nums1)   #   вывод отсортированного по убыванию списка



# print(id(nums))                  #   вывод id списка nums
# print(nums)
# # print('n ==', n, 'nn ==', nn)
# print(len(nums))                 #   вывод длины (количества элементов) списка nums (5 элементов)



# nums = []                        #   создан пустой список
# n = 0                            #   создана переменная n равная нулю
# while  n != -273:                #   цикл пока переменная n не равна -273
#     n = float(input('> '))       #   ввод следующего значения
#     nums.append(n)               #   добавление нового значения в конец списка
# nums.pop()                       #   удаление последнего значения
# print(nums)                      #   вывод списка



# """   Вывод минимального, максимального элемента и среднего значения. :.2f внутри f-строки показывает число как дробное с 2 знаками после запятой  """
# print(f'min = {min(nums)}\nmax = {max(nums)}\nmean = {sum(nums)/len(nums):.2f}')
# print(nums)




"""   ------------------------------------------------------------------------------------------------------------   """



"""

nums = [22, 33, 44, 55, 99]
ls = [2, 3, 4, 5, 9, 10]


'''   Итерация по индексам   '''
for i in range(len(nums)): # 0 1 2 3 4     #   для i в диапазоне длины списка nums
    print(i, nums[i],  end='     ')        #   end заменяет перенос на следующую строку несколькими пробелами, вывод идет в одну строку
print()                                    #   вывод индекса (i) и элемента с этим индексом
print()                                    #   вывод пустой строки - разделителя


'''   Итерация по значениям   '''
cnt = 0
for i in nums:
    print(cnt, i, end='    ')                             #   вывод cnt c 0, элементов списка nums в одну строку (end='    ')
    cnt += 1
print()
print()                                                   #   вывод пустой строки - разделителя

print()
print("print(list(enumerate(nums)))")
print(list(enumerate(nums)))
print()                                                   #   вывод пустой строки - разделителя


print("for i in enumerate(nums):")
for i in enumerate(nums):                                 #   цикл, где на каждой итерации переменная i получает кортеж из двух элементов: (индекс, значение).
    print(i[0], i[1], end='    ')
print()
print()                                                   #   вывод пустой строки - разделителя


print("for i, j in enumerate(nums):   ")                  #   такая запись удобнее
for i, j in enumerate(nums):                              #   цикл, который на каждой итерации даёт сразу индекс элемента и сам элемент
    print(i, j, end='    ' )
print()
print()                                                   #   вывод пустой строки - разделителя



names = ['Fedor', 'Alisa', 'Sasha', 'Glasha', 'Masha']
names.sort()                                              #   сортировка имен по алфавиту
for n, name in enumerate(names, 1):                       #   цикл, который перебирает список names, выдавая на каждой итерации номер (начиная с 1) и само имя
    print(f'{n}. {name}')

print()                                                   #   вывод пустой строки - разделителя

"""



"""   ------------------------------------------------------------------------------------------------------------   """



"""

nums = [22, 33, 44, 55, 99]
ls = [2, 3, 4, 5, 9, 10]

for i, j in zip(nums, ls):            #   zip() параллельно перебирает несколько коллекций и берет из них элементы с одинаковыми индексами.  
    print(i - j)                      #   из элемента с индексом 0 списка nums вычитается элемент с индексом 0 списка Ls

"""



"""   ------------------------------------------------------------------------------------------------------------   """



"""   

'''   Генерация случайных вещественных чисел   '''

print(random.random())                     #   случайное вещественное число 0.0, 1.0

print(random.uniform(0.9, 1))              #   случайное вещественное число от 0.9 до 1

print(random.uniform(-100, -99))           #   случайное вещественное число от −100 д −99.

print(random.randint(1, 10))               #   случайное целое число от 1 до 10

"""



"""   ------------------------------------------------------------------------------------------------------------   """



"""   
'''   Генерация целых случайных чисел   '''

print(random.randrange(2, 100, 2))   #   случайное чётное число из диапазона от 2 до 98 включительно.
print(random.randrange(1, 20, 2))    #   start, stop, step

"""



"""   ------------------------------------------------------------------------------------------------------------   """



"""   
'''   Случайный  выбор из коллекции   '''

print(random.choice(nums))              #   случайный элемент из nums
print(random.choice(range(1, 10, 3)))   #   создается последовательность 1, 4, 7 (1+3=4, 4+3=7, 7+3=10, но 10 не входит) и из нее выбирается случайное число
# print(random.choice(namеs))

"""



"""   ------------------------------------------------------------------------------------------------------------   """



"""   
'''   Генерация коллекции случайных объектов   '''

nums = [22, 33, 44, 55, 99]
names = ['Fedor', 'Alisa', 'Sasha', 'Glasha', 'Masha']

print(random.choices('абвгдеёжз', k=4))             #   выводит список из 4 случайных букв, выбранных из строки 'абвгдеёжз'
print(random.choices(names, k=7))                   #   выводит список из 7 случайных имён из списка names, одно и то же имя может встретиться несколько раз
print(random.sample(names, len(names)))             #   выводит все элементы списка names в случайном порядке
print(random.sample(names, 4))                      #   выводит список из 4 случайных уникальных имен, выбранных из списка names

"""



"""   ------------------------------------------------------------------------------------------------------------   """


"""   
'''   Выписать вторую строку без слов в первой строке   '''
a = 'I like python, it is very useful for data analysis'
b = 'python is the best tool for dealing with big data'

print(a)
print(b)

a = a.replace(',', '')         #   убираются запятые из строки "а"
a = a.split()                  #   строка "а" разбивается на элементы по пробелам (создается список)
b = b.split()                  #   строка "b" разбивается на элементы по пробелам (создается список)

print()                        #   вывод пустой строки-разделителя

print(a)
print(b)


c = []
for word in b:
    if word not in a:
        c.append(word)
print("Результат: ", c)
print(' ! '.join(c))

res = [word for word in b if word not in a]                                    #   создан список
print("Результат res: ",  res)                                                 #   создан список
print("Результат join(c): ", ' '.join(c))                                      #   создана строка (пример a = ' '.join(c))
print("Результат join[]: ", ' '.join([word for word in b if word not in a]))   #   создана строка

"""



"""   ------------------------------------------------------------------------------------------------------------   """


"""   
'''
Ввести оценки каждого студента за семестр по 
одной дисциплине в формате
name 4 3 4 5 4 3 4 .
В консоль вывести ведомость имя ср.балл 
отсортированную по имени и 
вторую отсортированную по среднему баллу.
'''

n = int(input('введите кол-во студентов: '))
data = []
for i in range(n):
    name, *marks = input('формат: name 4 3 4 5 4 3 4: ').split()
    print()

    marks = [int(mark) for mark in marks]
    print()

    mean = sum(marks) / len(marks)                                 #   средний балл
    data.append((name, mean))                                      #   в список data добавляется mean

print(data)

"""

"""   Мой вариант   

quantity = int(input("Введите количество студентов: "))
data = []
for i in range(quantity) :
    name, name_1, name_2, *marks = input("Введите данные в формате \"ФИО 1 2 3\": ").split()   #   ввод всех данных

    mark = [int(i) for i in marks]                                                             #   перевод оценок в int для расчета среднего балла

    avg = sum(mark) / len(mark)                                                                #   расчет среднего балла

    data.append((name, name_1, name_2, ' '.join(marks), avg))                                  #   внесение данных в список data
print()
for name, name_1, name_2, marks, avg in data :                                                 #   для переменных в data
    print(f'ФИО: {name} {name_1} {name_2}, оценки: {marks}, средний балл: {avg}')              #   красивый вывод через f-строку

"""

#
# s = 'Строка символов'
# print(s[1::2])
# res = []
# for n, symb in enumerate(s):
#     if n % 2 != 0:
#         res.append(symb)
# print(''.join(res))
# print(''.join([symb for n, symb in enumerate(s) if n % 2 != 0]))



quantity = int(input("Введите количество студентов: "))
data = []

for i in range(quantity) :
    name, name_1, name_2, *marks = input("Введите данные в формате \"ФИО 1 2 3\": ").split()
    mark = [int(i) for i in marks]
    avg = sum(mark) / len(mark)
    data.append((name, name_1, name_2, marks, avg))

print()

for name, name_1, name_2, marks, avg in data:  # для переменных в data
    print(f'ФИО: {name} {name_1} {name_2}, оценки: {' '.join(marks)}, средний балл: {avg}')